src/it/array2.org
#+TITLE: Ancora su Array Multidimensionali Statici vs Dinamici
#+AUTHOR: Jacopo Costantini

