docs/it/array2.html
<!doctype html>
<html lang="en">
<head>
<title>Ancora su Array Multidimensionali Statici vs Dinamici</title>
<!-- 2022-01-25 Tue 12:54 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Jacopo Costantini">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Array multidimensionali</a></li>
<li><a href="#sec-2">2. Array 2D Statici</a></li>
<li><a href="#sec-3">3. Array 2D Dinamici</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. Array 2D Dinamici <i>flattened</i></a></li>
<li><a href="#sec-3-2">3.2. Array di Array</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Puntatori a Righe</a></li>
<li><a href="#sec-5">5. Esempio Puntatori</a>
<ul class="nav">
<li><a href="#sec-5-1">5.1. Note Sintattiche sui Tipi Puntatori ad Array in C</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Ancora su Array Multidimensionali Statici vs Dinamici</h1>
