src/it/array2.org
* Array multidimensionali

Gli array multidimensionali in C sono una questione sottile. Limitiamoci agli array bidimensionali per cominciare, tenendo presente che tutto ciò che diremo scala anche a dimensioni addizionali. Definiamo innanzitutto il significato del termine statico e del termine dinamico:

- /statica/ è una struttura dati (un array in questo caso) che viene memorizzato nello *stack*;
- /dinamica/ invece è una struttura dati che viene memorizzata nello *heap*.

Cosa sono lo *stack* e lo *heap*?

- Lo /stack/ è la memoria dove vengono memorizzate le variabili in linguaggio *C*, è la memoria che contiene l’ambiente delle variabili delle funzioni e dei blocchi (detto anche *scope*) ed è *statica* nel senso che la sua grandezza è calcolata dal compilatore e rimane costante per tutta la durata del programma;
- Lo /heap/ è la memoria allocata dalle *malloc()*, è la *memoria dinamica* appunto perché si può *allocare* e *deallocare* liberamente. Viene anche chiamato *memoria dinamica*.

La vera differenza non è tanto nel tipo di memoria, perché in realtà i computer hanno un solo tipo di memoria, ma nel modo in cui viene gestita. Lo stack è un *pezzo di memoria* gestito dal linguaggio che funziona come una pila:

- *cresce* ad ogni entrata in una /funzione/ o in un /blocco/, producendo un nuovo pezzetto di memoria dove memorizza le variabili definite localmente (detto anche l’*ambiente* delle variabili);
- *decresce* ad ogni uscita da una /funzione/ o da un /blocco/, liberando la memoria che ospitava l’ambiente delle variabili locali.

Si considerino con attenzione gli *scope* in questo pezzo di codice (assumiamo che i puntatori, in quanto indirizzi di memoria, siano lunghi 8 byte nelle architetture moderne a 64 bit):

#+begin_src C -n 1
void f(int x, int b[5][5])
{
    int i;
    /* chiamare la funzione f fa CRESCERE lo stack della quantità giusta per
       ospitare i PARAMETRI x e b, oltre alla VARIABILE LOCALE i.
       x e i occupano 4 byte ciascuna, b è un puntatore che occupa = 8 byte,
       6 per un totale di 4 + 4 + 8 = 16 byte.
       si badi che un parametro di tipo array è equivalente ad un parametro
       di tipo puntatore ad array int(*b)[5]): non c'è copia degli
       elemnti, ma solo del puntatore. */
    if(x > 0){
        int a[5][5];
        /* se l'esecuzione entra nell'if allora lo stack CRESCE di
           altri 5 * 5 * 4 = 80 byte per ospitare l'array locale di 20 interi,
           oltre a 8 byte per il puntatore all'array 14 stesso, ovvero la variabile
           locale a, per un totale di 88 byte. */
        for(i = 0; i < 5; ++i)
        {
            int j;
            /* quando l'esecuzione entra nel blocco del for esterno,
               lo stack CRESCE di 4 byte per ospitare j. */
            for(j = 0; j < 5; ++j)
                a[i][j] = b[j][i];
        } /* all'uscita dal blocco del for esterno lo stack DECRESCE di 4 byte
             perché j è uscita dallo scope. */
    } /* all'uscita dall'if lo stack DECRESCE di 88 byte perché l'array a è uscito di scope. */
    else {
        for(i = 0; i < 5; ++i){
            int j;
            /* se invece l'esecuzione entra nell'else e di conseguenza
               nel blocco del for esterno qui sopra, lo stack CRESCE di 4 byte per ospitare j. */
            for(j=0;j<5;++j)
                b[i][j] = 0;

        }/*  all'uscita dal blocco del for esterno lo stack DECRESCE di 4 byte
             perché j è uscita dallo scope.
             si badi che la j definita nel for dell'if e la j definita qui
             sopra, anche se si chiamano con lo stesso nome, sono di fatto
             due variabili distinte, create e distrutte nello stack separatamente. */
    }
 } /* all'uscita dalla funzione f lo stack DECRESCE di 16 byte perché la
      variabile i ed i parametri x e b non esistono più */

int main()
{
    int a[5][5];
    int n = 4;
    /* appena il programma comincia lo stack CRESCE per ospitare l'array
       di grandezza 5 * 5 * 4 = 80 byte, oltre al puntatore di 8 byte all'array
       stesso (la variabile a di fatto è il 22 puntatore, non l'array di per sé).
       Anche l'intero n è una variabile locale che occupa 4 byte, per un
       totale di 80 + 8 + 4 = 92 byte.*/

    /* chiamare la funzione f produrrà la CRESCITA e la DECRESCITA della medesima
       quantità di stack: qualunque sia questa quantità, al ritorno dalla funzione
       lo stack si troverà nella stessa condizione in cui si trovava prima
       della chiamata, nulla è cambiato. */
    f(n, a);

    return 0;
} /* all'uscita dal main (e quindi dal programma) lo stack DECRESCE di 92 byte
     perché le variabili locali a e n non esistono più. */
#+end_src

Lo heap invece è una memoria *frammentata* ma normale, usabile liberamente dal programmatore, richiedibile tramite una chiamata alla funzione *malloc()* (o simili) e liberabile tramite la funzione *free()*. In linguaggio C ogni singolo pezzo di memoria allocato tramite *malloc()* deve essere liberato esplicitamente dal programmatore tramite un’apposita chiamata a *free()*.

