docs/it/array2.html

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Array multidimensionali</h2>
<div class="outline-text-2" id="text-1">
<p>
Gli array multidimensionali in C sono una questione sottile. Limitiamoci agli array bidimensionali per cominciare, tenendo presente che tutto ciò che diremo scala anche a dimensioni addizionali. Definiamo innanzitutto il significato del termine statico e del termine dinamico:
</p>

<ul class="org-ul">
<li><i>statica</i> è una struttura dati (un array in questo caso) che viene memorizzato nello <b>stack</b>;
</li>
<li><i>dinamica</i> invece è una struttura dati che viene memorizzata nello <b>heap</b>.
</li>
</ul>

<p>
Cosa sono lo <b>stack</b> e lo <b>heap</b>?
</p>

<ul class="org-ul">
<li>Lo <i>stack</i> è la memoria dove vengono memorizzate le variabili in linguaggio <b>C</b>, è la memoria che contiene l’ambiente delle variabili delle funzioni e dei blocchi (detto anche <b>scope</b>) ed è <b>statica</b> nel senso che la sua grandezza è calcolata dal compilatore e rimane costante per tutta la durata del programma;
</li>
<li>Lo <i>heap</i> è la memoria allocata dalle <b>malloc()</b>, è la <b>memoria dinamica</b> appunto perché si può <b>allocare</b> e <b>deallocare</b> liberamente. Viene anche chiamato <b>memoria dinamica</b>.
</li>
</ul>

<p>
La vera differenza non è tanto nel tipo di memoria, perché in realtà i computer hanno un solo tipo di memoria, ma nel modo in cui viene gestita. Lo stack è un <b>pezzo di memoria</b> gestito dal linguaggio che funziona come una pila:
</p>

<ul class="org-ul">
<li><b>cresce</b> ad ogni entrata in una <i>funzione</i> o in un <i>blocco</i>, producendo un nuovo pezzetto di memoria dove memorizza le variabili definite localmente (detto anche l’*ambiente* delle variabili);
</li>
<li><b>decresce</b> ad ogni uscita da una <i>funzione</i> o da un <i>blocco</i>, liberando la memoria che ospitava l’ambiente delle variabili locali.
</li>
</ul>

<p>
Si considerino con attenzione gli <b>scope</b> in questo pezzo di codice (assumiamo che i puntatori, in quanto indirizzi di memoria, siano lunghi 8 byte nelle architetture moderne a 64 bit):
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">void</span> <span style="color: #605a52;">f</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">x</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">b</span><span style="color: #9c739c;">[</span><span style="color: #465953; background-color: #d2ebe3;">5</span><span style="color: #9c739c;">][</span><span style="color: #465953; background-color: #d2ebe3;">5</span><span style="color: #9c739c;">]</span><span style="color: #7382a0;">)</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">i</span>;
    <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">chiamare la funzione f fa CRESCERE lo stack della quantit&#224; giusta per</span>
<span style="color: #b9a992;">       ospitare i PARAMETRI x e b, oltre alla VARIABILE LOCALE i.</span>
<span style="color: #b9a992;">       x e i occupano 4 byte ciascuna, b &#232; un puntatore che occupa = 8 byte,</span>
<span style="color: #b9a992;">       6 per un totale di 4 + 4 + 8 = 16 byte.</span>
<span style="color: #b9a992;">       si badi che un parametro di tipo array &#232; equivalente ad un parametro</span>
<span style="color: #b9a992;">       di tipo puntatore ad array int(*b)[5]): non c'&#232; copia degli</span>
<span style="color: #b9a992;">       elemnti, ma solo del puntatore.</span><span style="color: #b9a992;"> */</span>
    <span style="color: #614c61; background-color: #f1ddf1;">if</span><span style="color: #9c739c;">(</span>x &gt; <span style="color: #465953; background-color: #d2ebe3;">0</span><span style="color: #9c739c;">){</span>
        <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">a</span><span style="color: #81895d;">[</span><span style="color: #465953; background-color: #d2ebe3;">5</span><span style="color: #81895d;">][</span><span style="color: #465953; background-color: #d2ebe3;">5</span><span style="color: #81895d;">]</span>;
        <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">se l'esecuzione entra nell'if allora lo stack CRESCE di</span>
<span style="color: #b9a992;">           altri 5 * 5 * 4 = 80 byte per ospitare l'array locale di 20 interi,</span>
<span style="color: #b9a992;">           oltre a 8 byte per il puntatore all'array 14 stesso, ovvero la variabile</span>
<span style="color: #b9a992;">           locale a, per un totale di 88 byte.</span><span style="color: #b9a992;"> */</span>
        <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #81895d;">(</span>i = <span style="color: #465953; background-color: #d2ebe3;">0</span>; i &lt; <span style="color: #465953; background-color: #d2ebe3;">5</span>; ++i<span style="color: #81895d;">)</span>
        <span style="color: #81895d;">{</span>
            <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">j</span>;
            <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">quando l'esecuzione entra nel blocco del for esterno,</span>
<span style="color: #b9a992;">               lo stack CRESCE di 4 byte per ospitare j.</span><span style="color: #b9a992;"> */</span>
            <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #957f5f;">(</span>j = <span style="color: #465953; background-color: #d2ebe3;">0</span>; j &lt; <span style="color: #465953; background-color: #d2ebe3;">5</span>; ++j<span style="color: #957f5f;">)</span>
                a<span style="color: #957f5f;">[</span>i<span style="color: #957f5f;">][</span>j<span style="color: #957f5f;">]</span> = b<span style="color: #957f5f;">[</span>j<span style="color: #957f5f;">][</span>i<span style="color: #957f5f;">]</span>;
        <span style="color: #81895d;">}</span> <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">all'uscita dal blocco del for esterno lo stack DECRESCE di 4 byte</span>
<span style="color: #b9a992;">             perch&#233; j &#232; uscita dallo scope.</span><span style="color: #b9a992;"> */</span>
    <span style="color: #9c739c;">}</span> <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">all'uscita dall'if lo stack DECRESCE di 88 byte perch&#233; l'array a &#232; uscito di scope.</span><span style="color: #b9a992;"> */</span>
    <span style="color: #614c61; background-color: #f1ddf1;">else</span> <span style="color: #9c739c;">{</span>
        <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #81895d;">(</span>i = <span style="color: #465953; background-color: #d2ebe3;">0</span>; i &lt; <span style="color: #465953; background-color: #d2ebe3;">5</span>; ++i<span style="color: #81895d;">){</span>
            <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">j</span>;
            <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">se invece l'esecuzione entra nell'else e di conseguenza</span>
<span style="color: #b9a992;">               nel blocco del for esterno qui sopra, lo stack CRESCE di 4 byte per ospitare j.</span><span style="color: #b9a992;"> */</span>
            <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #957f5f;">(</span>j=<span style="color: #465953; background-color: #d2ebe3;">0</span>;j&lt;<span style="color: #465953; background-color: #d2ebe3;">5</span>;++j<span style="color: #957f5f;">)</span>
                b<span style="color: #957f5f;">[</span>i<span style="color: #957f5f;">][</span>j<span style="color: #957f5f;">]</span> = <span style="color: #465953; background-color: #d2ebe3;">0</span>;

        <span style="color: #81895d;">}</span><span style="color: #b9a992;">/*  </span><span style="color: #b9a992;">all'uscita dal blocco del for esterno lo stack DECRESCE di 4 byte</span>
<span style="color: #b9a992;">             perch&#233; j &#232; uscita dallo scope.</span>
<span style="color: #b9a992;">             si badi che la j definita nel for dell'if e la j definita qui</span>
<span style="color: #b9a992;">             sopra, anche se si chiamano con lo stesso nome, sono di fatto</span>
<span style="color: #b9a992;">             due variabili distinte, create e distrutte nello stack separatamente.</span><span style="color: #b9a992;"> */</span>
    <span style="color: #9c739c;">}</span>
 <span style="color: #7382a0;">}</span> <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">all'uscita dalla funzione f lo stack DECRESCE di 16 byte perch&#233; la</span>
<span style="color: #b9a992;">      variabile i ed i parametri x e b non esistono pi&#249;</span><span style="color: #b9a992;"> */</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">main</span><span style="color: #7382a0;">()</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">a</span><span style="color: #9c739c;">[</span><span style="color: #465953; background-color: #d2ebe3;">5</span><span style="color: #9c739c;">][</span><span style="color: #465953; background-color: #d2ebe3;">5</span><span style="color: #9c739c;">]</span>;
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">n</span> = <span style="color: #465953; background-color: #d2ebe3;">4</span>;
    <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">appena il programma comincia lo stack CRESCE per ospitare l'array</span>
<span style="color: #b9a992;">       di grandezza 5 * 5 * 4 = 80 byte, oltre al puntatore di 8 byte all'array</span>
<span style="color: #b9a992;">       stesso (la variabile a di fatto &#232; il 22 puntatore, non l'array di per s&#233;).</span>
<span style="color: #b9a992;">       Anche l'intero n &#232; una variabile locale che occupa 4 byte, per un</span>
<span style="color: #b9a992;">       totale di 80 + 8 + 4 = 92 byte.</span><span style="color: #b9a992;">*/</span>

    <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">chiamare la funzione f produrr&#224; la CRESCITA e la DECRESCITA della medesima</span>
<span style="color: #b9a992;">       quantit&#224; di stack: qualunque sia questa quantit&#224;, al ritorno dalla funzione</span>
<span style="color: #b9a992;">       lo stack si trover&#224; nella stessa condizione in cui si trovava prima</span>
<span style="color: #b9a992;">       della chiamata, nulla &#232; cambiato.</span><span style="color: #b9a992;"> */</span>
    f<span style="color: #9c739c;">(</span>n, a<span style="color: #9c739c;">)</span>;

    <span style="color: #614c61; background-color: #f1ddf1;">return</span> <span style="color: #465953; background-color: #d2ebe3;">0</span>;
<span style="color: #7382a0;">}</span> <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">all'uscita dal main (e quindi dal programma) lo stack DECRESCE di 92 byte</span>
<span style="color: #b9a992;">     perch&#233; le variabili locali a e n non esistono pi&#249;.</span><span style="color: #b9a992;"> */</span>
</pre>
</div>

<p>
Lo heap invece è una memoria <b>frammentata</b> ma normale, usabile liberamente dal programmatore, richiedibile tramite una chiamata alla funzione <b>malloc()</b> (o simili) e liberabile tramite la funzione <b>free()</b>. In linguaggio C ogni singolo pezzo di memoria allocato tramite <b>malloc()</b> deve essere liberato esplicitamente dal programmatore tramite un’apposita chiamata a <b>free()</b>.
</p>
</div>
</div>
