src/it/array2.org
* Array 2D Statici

Essendo il linguaggio a gestire automaticamente lo *stack*, il compilatore deve conoscere la dimensione di tutte le variabili di uno *scope*: ogni variabile occupa una certa quantità di memoria e il *compilatore calcola la somma di tutte le dimensioni di tutte le variabili allocando e deallocando la quantità di memoria corretta*.
Ad esempio:
+ un *int* occupa *32 bit = 4 byte*;
+ un *double* occupa *64 bit = 8 byte*;
+ un *array statico* di *N* elementi di tipo *T* occupa *N x sizeof(T) + 8*, dove gli *8 byte extra* sono per il *puntatore stesso all’array*.

Ecco perché gli array statici sono trattati come variabili e pertanto devono avere dimensione costante:
#+begin_quote
Perché il compilatore deve sapere quanto grandi sono.
#+end_quote

Un array bidimensionale statico ha un tipo tipo avente forma *T(** *)[ N ]* dove *T* è il tipo degli elementi ed *N* è una costante intera che indica il numero di colonne.
Ad esempio, dichiarando un *array bidimensionale statico* come *int a[ 3 ][ 5 ]*, la variabile *a* avrà tipo *int(** *)[ 5 ]*. Si badi che non compare l’informazione relativa al numero di righe nel tipo: questo perché il numero di righe è un’informazione irrilevante per il compilatore per accedere correttamente alle celle dell’array.

#+begin_quote
La ragione di questo sta nel memory layout degli array statici, vale a dire nel modo in cui vengono disposti gli elementi in memoria.
#+end_quote

Prendete la seguente definizione:
#+begin_src C -n 1
int a[10][20];
#+end_src

Questo è un *array bidimensionale* di interi statico avente *10 righe* e *20 colonne*. *In memoria tuttavia è disposto come un array unidimensionale*, come una sequenza continua di *10 x 20 = 200* elementi di tipo *int*. Ad esempio, l’espressione con doppio /subscript/ *a[ 3 ][ 8 ]* accede all’elemento alla *riga 3* e *colonna 8*; ma come fa a calcolare l’indirizzo esatto di memoria dove giace quell’elemento se l’array in realtà è piatto? Lo fa utilizzando la famosa formula che useremmo anche noi se facessimo il *flattening* dell’array: l’espressione *a[ 3 ][ 8 ]* dovremmo tradurla con *a[3 x 20 + 8]*.

In generale, dato un array di *H righe* e *W colonne*, per accedere all’elemento posizionato alla *riga i* e alla *colonna j* la formula è *i x W + j*. Il compilatore traduce automaticamente l’espressione *a[ 3 ][ 8 ]* in *a[3 x 20 + 8]*; quel 20 tuttavia, che corrisponde al numero di colonne dell’array a e che sostituisce la W nella formula generale, deve essere noto al compilatore, il quale ne deve tenere traccia nel tipo della variabile *a*. Il tipo di *a* infatti è *int(** *)[20]*: quel numero 20 compare al suo interno. Per il compilatore è sufficiente conoscere il numero di colonne, non serve conservare l’informazione del numero di righe perché nella formula generale non compare la *H* ma solo la *W*. I tipi sono il mondo in cui un compilatore tiene traccia delle informazioni relative ad una variabile: non esistono solamente i tipi base come *int, double, char ecc.* ma anche tipi più complessi, che catturano informazioni utili al compilatore per gestire quel dato.

* Array 2D Dinamici

Quando le dimensioni di un array non sono costanti, perché dipendenti da un input dell’utente, ad esempio, oppure da una qualche computazione, è possibile allocare un array di *H righe* e *W colonne* dinamicamente nello *heap* tramite chiamate alla funzione di libreria *malloc()*. Esistono due tecniche possibili che differiscono nel memory layout e nei tipi:

- /array flattened/: si alloca un array /monodimensionale/ di *H x W* elementi e lo si tratta come un *array bidimensionale*, cioè usando la formula *i x W + j* per accedere ad un elemento alla *riga i* e *colonna j*;
- /array di array/: si alloca un array /monodimensionale/ di *H* elementi di tipo *int**: ciascun elemento è un /puntatore/ ad un altro array di *W* interi che rappresenta una riga.

** Array 2D Dinamici /flattened/

Il termine “flattened” significa “appiattito” in inglese; e si utilizza in gergo per dire che un array bidimensionale è in realtà memorizzato come una sequenza continua di elementi, ogni riga segue in memoria la successiva.

#+begin_src C
int* a = (int*) malloc(sizeof(int) * 20 * 30);
#+end_src

La variabile *a* ha tipo *int** e punta ad un blocco di memoria in cui ci sono 60 interi contigui. La moltiplicazione 20 x 30 in nessun modo fa intendere al compilatore che stiamo allocando un array bidimensionale, è solamente un’espressione che scrive il programmatore per rendere più leggibile il fatto
che useremo quell’array monodimensionale come se fosse bidimensionale. Per accedere ad un elemento alla *riga i* e *colonna j* non possiamo usare il doppio /subscript/ *a[ i ][ j ]* perché *a* è in realtà un array monodimensionale per il compilatore; possiamo usare 1 solo subscript e siamo costretti ad calcolare la posizione dell’elemento che ci interessa tramite *a[i x 30 + j]*.

Il vantaggio di questa tecnica è che l’allocazione della memoria è semplice, ma l’accesso agli elementi è più verboso per il programmatore; per il computer, tuttavia, calcolare ogni volta la posizione tramite una moltiplicazione ed una somma è meno oneroso di un doppio dereference: si tratta quindi della tecnica più /efficiente/ dal punto di vista delle performance.

Si osservi infine che un array bidimensionale dinamico /flattened/ e un array bidimensionale statico hanno lo /stesso layout di memoria/, tuttavia i /tipi sono diversi/: nel caso di un array dinamico /flattened/ abbiamo un *int** e bisogna accedere con singolo /subscipt/ e la formula, nel caso dell’array statico abbiamo un *int(** *)[ N ]* (dove *N* è un intero costante) accessibile tramite doppio /subscript/.

