docs/it/array2.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Array 2D Statici</h2>
<div class="outline-text-2" id="text-2">
<p>
Essendo il linguaggio a gestire automaticamente lo <b>stack</b>, il compilatore deve conoscere la dimensione di tutte le variabili di uno <b>scope</b>: ogni variabile occupa una certa quantità di memoria e il <b>compilatore calcola la somma di tutte le dimensioni di tutte le variabili allocando e deallocando la quantità di memoria corretta</b>.
Ad esempio:
</p>
<ul class="org-ul">
<li>un <b>int</b> occupa <b>32 bit = 4 byte</b>;
</li>
<li>un <b>double</b> occupa <b>64 bit = 8 byte</b>;
</li>
<li>un <b>array statico</b> di <b>N</b> elementi di tipo <b>T</b> occupa <b>N x sizeof(T) + 8</b>, dove gli <b>8 byte extra</b> sono per il <b>puntatore stesso all’array</b>.
</li>
</ul>

<p>
Ecco perché gli array statici sono trattati come variabili e pertanto devono avere dimensione costante:
</p>
<blockquote>
<p>
Perché il compilatore deve sapere quanto grandi sono.
</p>
</blockquote>

<p>
Un array bidimensionale statico ha un tipo tipo avente forma <b>T(*</b> <b>)[ N ]</b> dove <b>T</b> è il tipo degli elementi ed <b>N</b> è una costante intera che indica il numero di colonne.
Ad esempio, dichiarando un <b>array bidimensionale statico</b> come <b>int a[ 3 ][ 5 ]</b>, la variabile <b>a</b> avrà tipo <b>int(*</b> <b>)[ 5 ]</b>. Si badi che non compare l’informazione relativa al numero di righe nel tipo: questo perché il numero di righe è un’informazione irrilevante per il compilatore per accedere correttamente alle celle dell’array.
</p>

<blockquote>
<p>
La ragione di questo sta nel memory layout degli array statici, vale a dire nel modo in cui vengono disposti gli elementi in memoria.
</p>
</blockquote>

<p>
Prendete la seguente definizione:
</p>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">a</span><span style="color: #7382a0;">[</span><span style="color: #465953; background-color: #d2ebe3;">10</span><span style="color: #7382a0;">][</span><span style="color: #465953; background-color: #d2ebe3;">20</span><span style="color: #7382a0;">]</span>;
</pre>
</div>

<p>
Questo è un <b>array bidimensionale</b> di interi statico avente <b>10 righe</b> e <b>20 colonne</b>. <b>In memoria tuttavia è disposto come un array unidimensionale</b>, come una sequenza continua di <b>10 x 20 = 200</b> elementi di tipo <b>int</b>. Ad esempio, l’espressione con doppio <i>subscript</i> <b>a[ 3 ][ 8 ]</b> accede all’elemento alla <b>riga 3</b> e <b>colonna 8</b>; ma come fa a calcolare l’indirizzo esatto di memoria dove giace quell’elemento se l’array in realtà è piatto? Lo fa utilizzando la famosa formula che useremmo anche noi se facessimo il <b>flattening</b> dell’array: l’espressione <b>a[ 3 ][ 8 ]</b> dovremmo tradurla con <b>a[3 x 20 + 8]</b>.
</p>

<p>
In generale, dato un array di <b>H righe</b> e <b>W colonne</b>, per accedere all’elemento posizionato alla <b>riga i</b> e alla <b>colonna j</b> la formula è <b>i x W + j</b>. Il compilatore traduce automaticamente l’espressione <b>a[ 3 ][ 8 ]</b> in <b>a[3 x 20 + 8]</b>; quel 20 tuttavia, che corrisponde al numero di colonne dell’array a e che sostituisce la W nella formula generale, deve essere noto al compilatore, il quale ne deve tenere traccia nel tipo della variabile <b>a</b>. Il tipo di <b>a</b> infatti è <b>int(*</b> <b>)[20]</b>: quel numero 20 compare al suo interno. Per il compilatore è sufficiente conoscere il numero di colonne, non serve conservare l’informazione del numero di righe perché nella formula generale non compare la <b>H</b> ma solo la <b>W</b>. I tipi sono il mondo in cui un compilatore tiene traccia delle informazioni relative ad una variabile: non esistono solamente i tipi base come <b>int, double, char ecc.</b> ma anche tipi più complessi, che catturano informazioni utili al compilatore per gestire quel dato.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Array 2D Dinamici</h2>
<div class="outline-text-2" id="text-3">
<p>
Quando le dimensioni di un array non sono costanti, perché dipendenti da un input dell’utente, ad esempio, oppure da una qualche computazione, è possibile allocare un array di <b>H righe</b> e <b>W colonne</b> dinamicamente nello <b>heap</b> tramite chiamate alla funzione di libreria <b>malloc()</b>. Esistono due tecniche possibili che differiscono nel memory layout e nei tipi:
</p>

<ul class="org-ul">
<li><i>array flattened</i>: si alloca un array <i>monodimensionale</i> di <b>H x W</b> elementi e lo si tratta come un <b>array bidimensionale</b>, cioè usando la formula <b>i x W + j</b> per accedere ad un elemento alla <b>riga i</b> e <b>colonna j</b>;
</li>
<li><i>array di array</i>: si alloca un array <i>monodimensionale</i> di <b>H</b> elementi di tipo <b>int*</b>: ciascun elemento è un <i>puntatore</i> ad un altro array di <b>W</b> interi che rappresenta una riga.
</li>
</ul>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Array 2D Dinamici <i>flattened</i></h3>
<div class="outline-text-3" id="text-3-1">
<p>
Il termine “flattened” significa “appiattito” in inglese; e si utilizza in gergo per dire che un array bidimensionale è in realtà memorizzato come una sequenza continua di elementi, ogni riga segue in memoria la successiva.
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #4c5361; background-color: #dde4f2;">a</span> = <span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>*<span style="color: #7382a0;">)</span> malloc<span style="color: #7382a0;">(</span><span style="color: #614c61; background-color: #f1ddf1;">sizeof</span><span style="color: #9c739c;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span><span style="color: #9c739c;">)</span> * <span style="color: #465953; background-color: #d2ebe3;">20</span> * <span style="color: #465953; background-color: #d2ebe3;">30</span><span style="color: #7382a0;">)</span>;
</pre>
</div>

<p>
La variabile <b>a</b> ha tipo <b>int*</b> e punta ad un blocco di memoria in cui ci sono 60 interi contigui. La moltiplicazione 20 x 30 in nessun modo fa intendere al compilatore che stiamo allocando un array bidimensionale, è solamente un’espressione che scrive il programmatore per rendere più leggibile il fatto
che useremo quell’array monodimensionale come se fosse bidimensionale. Per accedere ad un elemento alla <b>riga i</b> e <b>colonna j</b> non possiamo usare il doppio <i>subscript</i> <b>a[ i ][ j ]</b> perché <b>a</b> è in realtà un array monodimensionale per il compilatore; possiamo usare 1 solo subscript e siamo costretti ad calcolare la posizione dell’elemento che ci interessa tramite <b>a[i x 30 + j]</b>.
</p>

<p>
Il vantaggio di questa tecnica è che l’allocazione della memoria è semplice, ma l’accesso agli elementi è più verboso per il programmatore; per il computer, tuttavia, calcolare ogni volta la posizione tramite una moltiplicazione ed una somma è meno oneroso di un doppio dereference: si tratta quindi della tecnica più <i>efficiente</i> dal punto di vista delle performance.
</p>

<p>
Si osservi infine che un array bidimensionale dinamico <i>flattened</i> e un array bidimensionale statico hanno lo <i>stesso layout di memoria</i>, tuttavia i <i>tipi sono diversi</i>: nel caso di un array dinamico <i>flattened</i> abbiamo un <b>int*</b> e bisogna accedere con singolo <i>subscipt</i> e la formula, nel caso dell’array statico abbiamo un <b>int(*</b> <b>)[ N ]</b> (dove <b>N</b> è un intero costante) accessibile tramite doppio <i>subscript</i>.
</p>
</div>
</div>
