src/it/array2.org
** Array di Array

Un *array di array* di interi è un array /monodimensionale/ di *int** in cui ogni cella contiene il puntatore ad un array monodimensionale di elementi di tipo *int*. L’array di *int** ha tanti elementi quante sono le righe; e ciascun elemento punta ad un array /distinto/ di *int* che ha tanti elementi quante sono le colonne.

#+begin_src C
int** a = (int**) malloc(sizeof(int*) * 20);
#+end_src


Questo non è tutto però: abbiamo solamente allocato l’array che contiene i puntatori alle righe. Si badi che un array di *int** ha in effetti tipo *int***. Per ciascun elemento di a dobbiamo allocare dinamicamente un array di int lungo quanto una riga, ovvero di lunghezza pari al numero di colonne.

#+begin_src C
for(i = 0; i < 20; ++i)
    a[i] = (int*) malloc(sizeof(int) * 30);
#+end_src

Per un array di 20 x 30 elementi abbiamo fatto 1 + 20 = 21 *malloc()*: una per l’array di puntatori più una per ogni riga. Questo approccio ha lo svantaggio avere una allocazione (e la conseguente liberazione) di memoria più complessa, ma per accedere agli elementi di *a* non è necessaria nessuna formula: si usa la stessa sintassi con doppio /subscript/ che si usa per gli array bidimensionali statici, ad esempio *a[ 2 ][ 6 ]*. Nell’espressione *a[ i ][ j ]*, la sotto‐espressione *a[ i ]* legge un *int** alla posizione *i* dall’array di puntatori *a*; il secondo subscript *[ j ]* è riferito al puntatore ritornato dalla sottoespressione *a[ i ]* alla sua sinistra e va a pescare un *int* in posizione *j*.

E’ interessante notare che l’espressione *a[ i ][ j ]* è equivalente all’espressione **(*(a + i) + j)*. Si osservi infine che questa tecnica è più versatile di quanto non sembri, poiché un programmatore è libero di allocare righe di lunghezza diversa qualora sia necessario per l’algoritmo. Questo è possibile perché il tipo *int*** non specifica di per sé nessun vincolo sulla lunghezza delle righe (ovvero il numero di colonne).

* Puntatori a Righe

Si prenda in considerazione il seguente codice:

#+begin_src C -n 1
int a[10][20];
int* row = a[7];
int v1 = row[11], v2 = a[7][11]; /* v1 e v2 sono uguali */
#+end_src

Se *a* è una variabile di tipo *int(** *)[ 20 ]*, allora l’espressione *a[ 7 ]* produce un *int** che punta al primo elemento della riga 7: potete considerare *row* come un array monodimensionale che rappre‐ senta la riga 7. Ciò implica che l’espressione *row[ 11 ]* è equivalente all’espressione *a[ 7 ][ 11 ]*.

Si noti che la stessa cosa vale anche in caso di array di array allocati dinamicamente, poiché se *a* fosse un array di array dinamico allora avrebbe tipo *int***, ergo l’espressione *a[ 7 ]* produrrebbe un *int**.

