docs/it/array2.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Array di Array</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Un <b>array di array</b> di interi è un array <i>monodimensionale</i> di <b>int*</b> in cui ogni cella contiene il puntatore ad un array monodimensionale di elementi di tipo <b>int</b>. L’array di <b>int*</b> ha tanti elementi quante sono le righe; e ciascun elemento punta ad un array <i>distinto</i> di <b>int</b> che ha tanti elementi quante sono le colonne.
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">int</span>** <span style="color: #4c5361; background-color: #dde4f2;">a</span> = <span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>**<span style="color: #7382a0;">)</span> malloc<span style="color: #7382a0;">(</span><span style="color: #614c61; background-color: #f1ddf1;">sizeof</span><span style="color: #9c739c;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>*<span style="color: #9c739c;">)</span> * <span style="color: #465953; background-color: #d2ebe3;">20</span><span style="color: #7382a0;">)</span>;
</pre>
</div>


<p>
Questo non è tutto però: abbiamo solamente allocato l’array che contiene i puntatori alle righe. Si badi che un array di <b>int*</b> ha in effetti tipo <b>int**</b>. Per ciascun elemento di a dobbiamo allocare dinamicamente un array di int lungo quanto una riga, ovvero di lunghezza pari al numero di colonne.
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #7382a0;">(</span>i = <span style="color: #465953; background-color: #d2ebe3;">0</span>; i &lt; <span style="color: #465953; background-color: #d2ebe3;">20</span>; ++i<span style="color: #7382a0;">)</span>
    <span style="color: #605a52; background-color: #f7f3ee;">a</span><span style="color: #7382a0;">[</span>i<span style="color: #7382a0;">]</span> = <span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>*<span style="color: #7382a0;">)</span> malloc<span style="color: #7382a0;">(</span><span style="color: #614c61; background-color: #f1ddf1;">sizeof</span><span style="color: #9c739c;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span><span style="color: #9c739c;">)</span> * <span style="color: #465953; background-color: #d2ebe3;">30</span><span style="color: #7382a0;">)</span>;
</pre>
</div>

<p>
Per un array di 20 x 30 elementi abbiamo fatto 1 + 20 = 21 <b>malloc()</b>: una per l’array di puntatori più una per ogni riga. Questo approccio ha lo svantaggio avere una allocazione (e la conseguente liberazione) di memoria più complessa, ma per accedere agli elementi di <b>a</b> non è necessaria nessuna formula: si usa la stessa sintassi con doppio <i>subscript</i> che si usa per gli array bidimensionali statici, ad esempio <b>a[ 2 ][ 6 ]</b>. Nell’espressione <b>a[ i ][ j ]</b>, la sotto‐espressione <b>a[ i ]</b> legge un <b>int*</b> alla posizione <b>i</b> dall’array di puntatori <b>a</b>; il secondo subscript <b>[ j ]</b> è riferito al puntatore ritornato dalla sottoespressione <b>a[ i ]</b> alla sua sinistra e va a pescare un <b>int</b> in posizione <b>j</b>.
</p>

<p>
E’ interessante notare che l’espressione <b>a[ i ][ j ]</b> è equivalente all’espressione <b>*(*(a + i) + j)</b>. Si osservi infine che questa tecnica è più versatile di quanto non sembri, poiché un programmatore è libero di allocare righe di lunghezza diversa qualora sia necessario per l’algoritmo. Questo è possibile perché il tipo <b>int**</b> non specifica di per sé nessun vincolo sulla lunghezza delle righe (ovvero il numero di colonne).
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Puntatori a Righe</h2>
<div class="outline-text-2" id="text-4">
<p>
Si prenda in considerazione il seguente codice:
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">a</span><span style="color: #7382a0;">[</span><span style="color: #465953; background-color: #d2ebe3;">10</span><span style="color: #7382a0;">][</span><span style="color: #465953; background-color: #d2ebe3;">20</span><span style="color: #7382a0;">]</span>;
<span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #4c5361; background-color: #dde4f2;">row</span> = a<span style="color: #7382a0;">[</span><span style="color: #465953; background-color: #d2ebe3;">7</span><span style="color: #7382a0;">]</span>;
<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">v1</span> = row<span style="color: #7382a0;">[</span><span style="color: #465953; background-color: #d2ebe3;">11</span><span style="color: #7382a0;">]</span>, <span style="color: #4c5361; background-color: #dde4f2;">v2</span> = a<span style="color: #7382a0;">[</span><span style="color: #465953; background-color: #d2ebe3;">7</span><span style="color: #7382a0;">][</span><span style="color: #465953; background-color: #d2ebe3;">11</span><span style="color: #7382a0;">]</span>; <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">v1 e v2 sono uguali</span><span style="color: #b9a992;"> */</span>
</pre>
</div>

<p>
Se <b>a</b> è una variabile di tipo <b>int(*</b> <b>)[ 20 ]</b>, allora l’espressione <b>a[ 7 ]</b> produce un <b>int*</b> che punta al primo elemento della riga 7: potete considerare <b>row</b> come un array monodimensionale che rappre‐ senta la riga 7. Ciò implica che l’espressione <b>row[ 11 ]</b> è equivalente all’espressione <b>a[ 7 ][ 11 ]</b>.
</p>

<p>
Si noti che la stessa cosa vale anche in caso di array di array allocati dinamicamente, poiché se <b>a</b> fosse un array di array dinamico allora avrebbe tipo <b>int**</b>, ergo l’espressione <b>a[ 7 ]</b> produrrebbe un <b>int*</b>.
</p>
</div>
</div>
