src/it/array2.org
* Esempio Puntatori

Per approfondire la questione prendete in esame il seguente codice ANSI‐C e studiate con attenzione i tipi dei binding e i relativi commenti:

#+begin_src C -n 1
#include <stdlib.h>
#include <stdio.h>

/* alloca array dinamici 2D di dimensioni passate come argomenti */
int** allocate_array_of_array(int dim1, int dim2)
{
    inti;
    int** a = (int**) malloc(sizeof(int*) * dim1);
    for(i = 0; i < dim1; ++i)
        a[i] = (int*) malloc(sizeof(int) * dim2);
    return a;
}
/* libera la memoria di un array dinamico 2D allocato tramite la funzione allocate_dynamic_array2d() */
void free_array_of_array(int** a, int dim1)
{
    int i;
    for(i=0;i<dim1;++i)
    {
        free(a[i]);
    }
    free(a);
}

/* stampa array dinamici 2D di dimensioni passate come argomenti */
void print_array_of_array(int** a, int dim1, int dim2)
{
    int i, j;
    for(i=0;i<dim1;++i)
        for(j=0;j<dim2;++j)
            printf("a[%d][%d] = %d\n", i, j, a[i][j]);
}

/* allora una array bidimensionale flattened tramite una singola chiamata alla malloc() */
int* allocate_flattened_array2d(int dim1, int dim2)
{
    return (int*) malloc(sizeof(int) * dim1 * dim2);
}

/* libera la memoria di un array flattened: si noti che è praticamente una semplice chiamata alla free().
in gergo si chiamano STUB le funzioni che semplicemente
chiamano un'altra funzione. */
int* free_flattened_array2d(int* a)
{
    free(a);
}

/* stampa array dinamici 2D di dimensioni passate come argomenti */
void print_flattened_array(int* a, int dim1, int dim2)
{
    int i, j;
    for(i=0;i<dim1;++i)
        for(j=0;j<dim2;++j)
            printf("a[%d][%d] = %d\n", i, j, a[i * dim2 + j]);
}

/* stampa array statici aventi 4 colonne ed un numero qualunque di righe passato come argomento */
void print_static_array2d__4columns(int(*a)[4], int dim1) {
    int i, j;
    for(i=0;i<dim1;++i)
        for(j=0;j<4;++j)
            printf("a[%d][%d] = %d\n", i, j, a[i][j]);
}

int main()
{
    int a[2][4] = {     /* array 2D statico 2 righe, 4 colonne */
        {10, 11, 12, 13},
        {14, 15, 16, 17}
    };

    int b[3][4];        /* array 2D statico 8 righe, 4 colonne (non inizializzato).
                           a e b hanno lo stesso tipo, ovvero int(*)[4].
                           da notare che l'informazione del numero di righe non
                           compare nel tipo, ma solamente il numero di colonne.*/


    int** array_of_array; /* doppio pointer per array bidimensionale dinamico*/
    int*  flattened_array; /* singolo pointer per un array bidimensionale flattened*/

    int i, j;

    int (*p1)[4] = a; /* OK: p1 è equivalente ad a*/
    int* p2 = a[0]; /* OK: p2 punta alla prima riga dell'array a */
    int* p3 = p1[0]; /* OK: p3 è uguale a p2*/
    int** p5 = a; /* TYPE ERROR: il tipo di a è int(*)[4] non int** */ 84

    int v1 = a[0][3]; /*OK:v1vale13*/
    int v2 = p1[0][3]; /*OK:v2èugualeav1*/
    int v3 = p2[3]; /* OK: equivalente a a[0][3], quindi v1, v2 e v3 sono uguali*/
    int v4 = a[2]; /* TYPE ERROR: a[2] non produce un int ma un int* */
    int v5 = p2[0]; /* OK: equivalente a a[0][0], v5 vale 10 */
    int v6 = *p2; /* OK: equivalente a p2[0], quindi v6 è uguale a v5*/


    /* equivalente a stampare l'array a */
    print_static_array2d__4columns(p1, 2);

    /* anche b si può stampare con la stessa funzione, perché a e b hanno lo stesso tipo.
       si badi che il numero di colonne compare nel tipo stesso int(*)[4], quindi è noto
       a compile-time, mentre il numero di righe è passato come argomento, quindi è noto
       solo a runtime. */
    print_static_array2d__4columns(b, 3);

    /* alloca e poi stampa un array di array avente 10 righe e 20 colonne in memoria
       dinamica (cioè nello heap). */
    array_of_arrayc = allocate_array_of_array(10, 20);
    print_array_of_array(array_of_array, 10, 20);
    /* libera la memoria dell'array di array */
    free_array_of_array(array_of_array);

    /* alloca e poi stampa un array bidimensionale flattened avente 10 righe e 20
       colonne in memoria dinamica. */
    flattened_array = allocate_flattened_array(10, 20);
    print_flattened_array(flattened_array, 10, 20);

    /* libera la memoria dell'array flattened */
    free_array_of_array(flattened_array);

    return 0;
}

#+end_src

