docs/it/array2.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Esempio Puntatori</h2>
<div class="outline-text-2" id="text-5">
<p>
Per approfondire la questione prendete in esame il seguente codice ANSI‐C e studiate con attenzione i tipi dei binding e i relativi commenti:
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdlib.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>
<span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdio.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>

<span style="color: #b9a992;">/* </span><span style="color: #b9a992;">alloca array dinamici 2D di dimensioni passate come argomenti</span><span style="color: #b9a992;"> */</span>
<span style="color: #605a52; background-color: #f7f3ee;">int</span>** <span style="color: #605a52;">allocate_array_of_array</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">dim1</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">dim2</span><span style="color: #7382a0;">)</span>
<span style="color: #7382a0;">{</span>
    inti;
    <span style="color: #605a52; background-color: #f7f3ee;">int</span>** <span style="color: #4c5361; background-color: #dde4f2;">a</span> = <span style="color: #9c739c;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>**<span style="color: #9c739c;">)</span> malloc<span style="color: #9c739c;">(</span><span style="color: #614c61; background-color: #f1ddf1;">sizeof</span><span style="color: #81895d;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>*<span style="color: #81895d;">)</span> * dim1<span style="color: #9c739c;">)</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #9c739c;">(</span>i = <span style="color: #465953; background-color: #d2ebe3;">0</span>; i &lt; dim1; ++i<span style="color: #9c739c;">)</span>
        a<span style="color: #9c739c;">[</span>i<span style="color: #9c739c;">]</span> = <span style="color: #9c739c;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>*<span style="color: #9c739c;">)</span> malloc<span style="color: #9c739c;">(</span><span style="color: #614c61; background-color: #f1ddf1;">sizeof</span><span style="color: #81895d;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span><span style="color: #81895d;">)</span> * dim2<span style="color: #9c739c;">)</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">return</span> a;
<span style="color: #7382a0;">}</span>
<span style="color: #b9a992;">/* </span><span style="color: #b9a992;">libera la memoria di un array dinamico 2D allocato tramite la funzione allocate_dynamic_array2d()</span><span style="color: #b9a992;"> */</span>
<span style="color: #605a52; background-color: #f7f3ee;">void</span> <span style="color: #605a52;">free_array_of_array</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>** <span style="color: #4c5361; background-color: #dde4f2;">a</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">dim1</span><span style="color: #7382a0;">)</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">i</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #9c739c;">(</span>i=<span style="color: #465953; background-color: #d2ebe3;">0</span>;i&lt;dim1;++i<span style="color: #9c739c;">)</span>
    <span style="color: #9c739c;">{</span>
        free<span style="color: #81895d;">(</span>a<span style="color: #957f5f;">[</span>i<span style="color: #957f5f;">]</span><span style="color: #81895d;">)</span>;
    <span style="color: #9c739c;">}</span>
    free<span style="color: #9c739c;">(</span>a<span style="color: #9c739c;">)</span>;
<span style="color: #7382a0;">}</span>

<span style="color: #b9a992;">/* </span><span style="color: #b9a992;">stampa array dinamici 2D di dimensioni passate come argomenti</span><span style="color: #b9a992;"> */</span>
<span style="color: #605a52; background-color: #f7f3ee;">void</span> <span style="color: #605a52;">print_array_of_array</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>** <span style="color: #4c5361; background-color: #dde4f2;">a</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">dim1</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">dim2</span><span style="color: #7382a0;">)</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">i</span>, <span style="color: #4c5361; background-color: #dde4f2;">j</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #9c739c;">(</span>i=<span style="color: #465953; background-color: #d2ebe3;">0</span>;i&lt;dim1;++i<span style="color: #9c739c;">)</span>
        <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #9c739c;">(</span>j=<span style="color: #465953; background-color: #d2ebe3;">0</span>;j&lt;dim2;++j<span style="color: #9c739c;">)</span>
            printf<span style="color: #9c739c;">(</span><span style="color: #525643; background-color: #e2e9c1;">"a[%d][%d] = %d\n"</span>, i, j, a<span style="color: #81895d;">[</span>i<span style="color: #81895d;">][</span>j<span style="color: #81895d;">]</span><span style="color: #9c739c;">)</span>;
<span style="color: #7382a0;">}</span>

<span style="color: #b9a992;">/* </span><span style="color: #b9a992;">allora una array bidimensionale flattened tramite una singola chiamata alla malloc()</span><span style="color: #b9a992;"> */</span>
<span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #605a52;">allocate_flattened_array2d</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">dim1</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">dim2</span><span style="color: #7382a0;">)</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #614c61; background-color: #f1ddf1;">return</span> <span style="color: #9c739c;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>*<span style="color: #9c739c;">)</span> malloc<span style="color: #9c739c;">(</span><span style="color: #614c61; background-color: #f1ddf1;">sizeof</span><span style="color: #81895d;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span><span style="color: #81895d;">)</span> * dim1 * dim2<span style="color: #9c739c;">)</span>;
<span style="color: #7382a0;">}</span>

<span style="color: #b9a992;">/* </span><span style="color: #b9a992;">libera la memoria di un array flattened: si noti che &#232; praticamente una semplice chiamata alla free().</span>
<span style="color: #b9a992;">in gergo si chiamano STUB le funzioni che semplicemente</span>
<span style="color: #b9a992;">chiamano un'altra funzione.</span><span style="color: #b9a992;"> */</span>
<span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #605a52;">free_flattened_array2d</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #4c5361; background-color: #dde4f2;">a</span><span style="color: #7382a0;">)</span>
<span style="color: #7382a0;">{</span>
    free<span style="color: #9c739c;">(</span>a<span style="color: #9c739c;">)</span>;
<span style="color: #7382a0;">}</span>

<span style="color: #b9a992;">/* </span><span style="color: #b9a992;">stampa array dinamici 2D di dimensioni passate come argomenti</span><span style="color: #b9a992;"> */</span>
<span style="color: #605a52; background-color: #f7f3ee;">void</span> <span style="color: #605a52;">print_flattened_array</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #4c5361; background-color: #dde4f2;">a</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">dim1</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">dim2</span><span style="color: #7382a0;">)</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">i</span>, <span style="color: #4c5361; background-color: #dde4f2;">j</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #9c739c;">(</span>i=<span style="color: #465953; background-color: #d2ebe3;">0</span>;i&lt;dim1;++i<span style="color: #9c739c;">)</span>
        <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #9c739c;">(</span>j=<span style="color: #465953; background-color: #d2ebe3;">0</span>;j&lt;dim2;++j<span style="color: #9c739c;">)</span>
            printf<span style="color: #9c739c;">(</span><span style="color: #525643; background-color: #e2e9c1;">"a[%d][%d] = %d\n"</span>, i, j, a<span style="color: #81895d;">[</span>i * dim2 + j<span style="color: #81895d;">]</span><span style="color: #9c739c;">)</span>;
<span style="color: #7382a0;">}</span>

<span style="color: #b9a992;">/* </span><span style="color: #b9a992;">stampa array statici aventi 4 colonne ed un numero qualunque di righe passato come argomento</span><span style="color: #b9a992;"> */</span>
<span style="color: #605a52; background-color: #f7f3ee;">void</span> <span style="color: #605a52;">print_static_array2d__4columns</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span><span style="color: #9c739c;">(</span>*<span style="color: #4c5361; background-color: #dde4f2;">a</span><span style="color: #9c739c;">)[</span><span style="color: #465953; background-color: #d2ebe3;">4</span><span style="color: #9c739c;">]</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">dim1</span><span style="color: #7382a0;">)</span> <span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">i</span>, <span style="color: #4c5361; background-color: #dde4f2;">j</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #9c739c;">(</span>i=<span style="color: #465953; background-color: #d2ebe3;">0</span>;i&lt;dim1;++i<span style="color: #9c739c;">)</span>
        <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #9c739c;">(</span>j=<span style="color: #465953; background-color: #d2ebe3;">0</span>;j&lt;<span style="color: #465953; background-color: #d2ebe3;">4</span>;++j<span style="color: #9c739c;">)</span>
            printf<span style="color: #9c739c;">(</span><span style="color: #525643; background-color: #e2e9c1;">"a[%d][%d] = %d\n"</span>, i, j, a<span style="color: #81895d;">[</span>i<span style="color: #81895d;">][</span>j<span style="color: #81895d;">]</span><span style="color: #9c739c;">)</span>;
<span style="color: #7382a0;">}</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">main</span><span style="color: #7382a0;">()</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">a</span><span style="color: #9c739c;">[</span><span style="color: #465953; background-color: #d2ebe3;">2</span><span style="color: #9c739c;">][</span><span style="color: #465953; background-color: #d2ebe3;">4</span><span style="color: #9c739c;">]</span> = <span style="color: #9c739c;">{</span>     <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">array 2D statico 2 righe, 4 colonne</span><span style="color: #b9a992;"> */</span>
        <span style="color: #81895d;">{</span><span style="color: #465953; background-color: #d2ebe3;">10</span>, <span style="color: #465953; background-color: #d2ebe3;">11</span>, <span style="color: #465953; background-color: #d2ebe3;">12</span>, <span style="color: #465953; background-color: #d2ebe3;">13</span><span style="color: #81895d;">}</span>,
        <span style="color: #81895d;">{</span><span style="color: #465953; background-color: #d2ebe3;">14</span>, <span style="color: #465953; background-color: #d2ebe3;">15</span>, <span style="color: #465953; background-color: #d2ebe3;">16</span>, <span style="color: #465953; background-color: #d2ebe3;">17</span><span style="color: #81895d;">}</span>
    <span style="color: #9c739c;">}</span>;

    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">b</span><span style="color: #9c739c;">[</span><span style="color: #465953; background-color: #d2ebe3;">3</span><span style="color: #9c739c;">][</span><span style="color: #465953; background-color: #d2ebe3;">4</span><span style="color: #9c739c;">]</span>;        <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">array 2D statico 8 righe, 4 colonne (non inizializzato).</span>
<span style="color: #b9a992;">                           a e b hanno lo stesso tipo, ovvero int(*)[4].</span>
<span style="color: #b9a992;">                           da notare che l'informazione del numero di righe non</span>
<span style="color: #b9a992;">                           compare nel tipo, ma solamente il numero di colonne.</span><span style="color: #b9a992;">*/</span>


    <span style="color: #605a52; background-color: #f7f3ee;">int</span>** <span style="color: #4c5361; background-color: #dde4f2;">array_of_array</span>; <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">doppio pointer per array bidimensionale dinamico</span><span style="color: #b9a992;">*/</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span>*  <span style="color: #4c5361; background-color: #dde4f2;">flattened_array</span>; <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">singolo pointer per un array bidimensionale flattened</span><span style="color: #b9a992;">*/</span>

    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">i</span>, <span style="color: #4c5361; background-color: #dde4f2;">j</span>;

    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #9c739c;">(</span>*<span style="color: #4c5361; background-color: #dde4f2;">p1</span><span style="color: #9c739c;">)[</span><span style="color: #465953; background-color: #d2ebe3;">4</span><span style="color: #9c739c;">]</span> = a; <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">OK: p1 &#232; equivalente ad a</span><span style="color: #b9a992;">*/</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #4c5361; background-color: #dde4f2;">p2</span> = a<span style="color: #9c739c;">[</span><span style="color: #465953; background-color: #d2ebe3;">0</span><span style="color: #9c739c;">]</span>; <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">OK: p2 punta alla prima riga dell'array a</span><span style="color: #b9a992;"> */</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #4c5361; background-color: #dde4f2;">p3</span> = p1<span style="color: #9c739c;">[</span><span style="color: #465953; background-color: #d2ebe3;">0</span><span style="color: #9c739c;">]</span>; <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">OK: p3 &#232; uguale a p2</span><span style="color: #b9a992;">*/</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span>** <span style="color: #4c5361; background-color: #dde4f2;">p5</span> = a; <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">TYPE ERROR: il tipo di a &#232; int(*)[4] non int**</span><span style="color: #b9a992;"> */</span> <span style="color: #465953; background-color: #d2ebe3;">84</span>

    <span style="color: #605a52; background-color: #f7f3ee;">int</span> v1 = a<span style="color: #9c739c;">[</span><span style="color: #465953; background-color: #d2ebe3;">0</span><span style="color: #9c739c;">][</span><span style="color: #465953; background-color: #d2ebe3;">3</span><span style="color: #9c739c;">]</span>; <span style="color: #b9a992;">/*</span><span style="color: #b9a992;">OK:v1vale13</span><span style="color: #b9a992;">*/</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">v2</span> = p1<span style="color: #9c739c;">[</span><span style="color: #465953; background-color: #d2ebe3;">0</span><span style="color: #9c739c;">][</span><span style="color: #465953; background-color: #d2ebe3;">3</span><span style="color: #9c739c;">]</span>; <span style="color: #b9a992;">/*</span><span style="color: #b9a992;">OK:v2&#232;ugualeav1</span><span style="color: #b9a992;">*/</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">v3</span> = p2<span style="color: #9c739c;">[</span><span style="color: #465953; background-color: #d2ebe3;">3</span><span style="color: #9c739c;">]</span>; <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">OK: equivalente a a[0][3], quindi v1, v2 e v3 sono uguali</span><span style="color: #b9a992;">*/</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">v4</span> = a<span style="color: #9c739c;">[</span><span style="color: #465953; background-color: #d2ebe3;">2</span><span style="color: #9c739c;">]</span>; <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">TYPE ERROR: a[2] non produce un int ma un int*</span><span style="color: #b9a992;"> */</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">v5</span> = p2<span style="color: #9c739c;">[</span><span style="color: #465953; background-color: #d2ebe3;">0</span><span style="color: #9c739c;">]</span>; <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">OK: equivalente a a[0][0], v5 vale 10</span><span style="color: #b9a992;"> */</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">v6</span> = *p2; <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">OK: equivalente a p2[0], quindi v6 &#232; uguale a v5</span><span style="color: #b9a992;">*/</span>


    <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">equivalente a stampare l'array a</span><span style="color: #b9a992;"> */</span>
    print_static_array2d__4columns<span style="color: #9c739c;">(</span>p1, <span style="color: #465953; background-color: #d2ebe3;">2</span><span style="color: #9c739c;">)</span>;

    <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">anche b si pu&#242; stampare con la stessa funzione, perch&#233; a e b hanno lo stesso tipo.</span>
<span style="color: #b9a992;">       si badi che il numero di colonne compare nel tipo stesso int(*)[4], quindi &#232; noto</span>
<span style="color: #b9a992;">       a compile-time, mentre il numero di righe &#232; passato come argomento, quindi &#232; noto</span>
<span style="color: #b9a992;">       solo a runtime.</span><span style="color: #b9a992;"> */</span>
    print_static_array2d__4columns<span style="color: #9c739c;">(</span>b, <span style="color: #465953; background-color: #d2ebe3;">3</span><span style="color: #9c739c;">)</span>;

    <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">alloca e poi stampa un array di array avente 10 righe e 20 colonne in memoria</span>
<span style="color: #b9a992;">       dinamica (cio&#232; nello heap).</span><span style="color: #b9a992;"> */</span>
    array_of_arrayc = allocate_array_of_array<span style="color: #9c739c;">(</span><span style="color: #465953; background-color: #d2ebe3;">10</span>, <span style="color: #465953; background-color: #d2ebe3;">20</span><span style="color: #9c739c;">)</span>;
    print_array_of_array<span style="color: #9c739c;">(</span>array_of_array, <span style="color: #465953; background-color: #d2ebe3;">10</span>, <span style="color: #465953; background-color: #d2ebe3;">20</span><span style="color: #9c739c;">)</span>;
    <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">libera la memoria dell'array di array</span><span style="color: #b9a992;"> */</span>
    free_array_of_array<span style="color: #9c739c;">(</span>array_of_array<span style="color: #9c739c;">)</span>;

    <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">alloca e poi stampa un array bidimensionale flattened avente 10 righe e 20</span>
<span style="color: #b9a992;">       colonne in memoria dinamica.</span><span style="color: #b9a992;"> */</span>
    flattened_array = allocate_flattened_array<span style="color: #9c739c;">(</span><span style="color: #465953; background-color: #d2ebe3;">10</span>, <span style="color: #465953; background-color: #d2ebe3;">20</span><span style="color: #9c739c;">)</span>;
    print_flattened_array<span style="color: #9c739c;">(</span>flattened_array, <span style="color: #465953; background-color: #d2ebe3;">10</span>, <span style="color: #465953; background-color: #d2ebe3;">20</span><span style="color: #9c739c;">)</span>;

    <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">libera la memoria dell'array flattened</span><span style="color: #b9a992;"> */</span>
    free_array_of_array<span style="color: #9c739c;">(</span>flattened_array<span style="color: #9c739c;">)</span>;

    <span style="color: #614c61; background-color: #f1ddf1;">return</span> <span style="color: #465953; background-color: #d2ebe3;">0</span>;
<span style="color: #7382a0;">}</span>

</pre>
</div>
</div>
