src/it/array2.org
** Note Sintattiche sui Tipi Puntatori ad Array in C

La sintassi dei tipi in C è bizzarra. Il linguaggio ci abitua a credere che, in una dichiarazione, la sintassi sia:

#+begin_example
T x;        /* dichiarazione */
T x = expr  /* inizializzazione */
#+end_example

Dove T è un tipo, x è un identificatore, expr è una espressione di tipo T o convertibile a T. Come ad esempio come in:

#+begin_src C -n 1
int n = 3;
double m = 7.2 + 12.3;
char c;
#+end_src

Pertanto ci si potrebbe aspettare che per dichiarare una variabile il cui tipo è “array di 4 colonne”, ovvero *int(** *)[ 4 ]*, si possa scrivere così:

#+begin_src C -n 1
int(*)[4] myarray; /* SYNTAX ERROR */
#+end_src

Ma non è così ‐ il modo corretto di dichiarare una variabile avente tipo *int(** *)[ 4 ]* è il seguente:

#+begin_src C -n 1
int (*myarray)[4];
#+end_src

Si noti che il nome dell’identificatore myarray compare dentro le parentesi tonde appena a destra dell’asterisco. Lo stesso vale per i nomi dei parametri di funzione, che seguono le stesse regole sintat‐ tiche delle dichiarazioni di variabili.

La ragione di questa strana sintassi è che uno statement di dichiarazione può includere dichiarazioni multiple che alternano puntatori e non, quindi, a livello sintattico, i puntatori diventano qualificatori degli identificatori, come ad esempio in:

#+begin_src C
int a, *b, **c, d; /* a e d hanno tipo int; b ha tipo int*; c ha tipo int** */
#+end_src

L’asterisco, in altre parole, non fa parte del sintagma del tipo nella parte sinistra, ma compare appena a sinistra dell’identificatore qualificando la promozione a puntatore. Estendendo questa regola gram‐ maticale si comprende anche la sintassi dei puntatori ad array statici e dei puntatori a funzione:

#+begin_src C
int i, j, (*d)[5], (*e)(double, char);
#+end_src

Questa riga dichiara: 2 interi i e j; un puntatore d ad array bidimensionale di interi avente 5 colonne; un puntatore e a funzione avente 2 argomenti di tipo double e char rispettivamente e tipo di ritorno int.


[[* Array multidimensionali][[ TOP ]​]]  [[file:ITlist.org][[ HOME ]​]]
