docs/it/array2.html

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Note Sintattiche sui Tipi Puntatori ad Array in C</h3>
<div class="outline-text-3" id="text-5-1">
<p>
La sintassi dei tipi in C è bizzarra. Il linguaggio ci abitua a credere che, in una dichiarazione, la sintassi sia:
</p>

<pre class="example">
T x;        /* dichiarazione */
T x = expr  /* inizializzazione */
</pre>

<p>
Dove T è un tipo, x è un identificatore, expr è una espressione di tipo T o convertibile a T. Come ad esempio come in:
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">n</span> = <span style="color: #465953; background-color: #d2ebe3;">3</span>;
<span style="color: #605a52; background-color: #f7f3ee;">double</span> <span style="color: #4c5361; background-color: #dde4f2;">m</span> = <span style="color: #465953; background-color: #d2ebe3;">7.2</span> + <span style="color: #465953; background-color: #d2ebe3;">12.3</span>;
<span style="color: #605a52; background-color: #f7f3ee;">char</span> <span style="color: #4c5361; background-color: #dde4f2;">c</span>;
</pre>
</div>

<p>
Pertanto ci si potrebbe aspettare che per dichiarare una variabile il cui tipo è “array di 4 colonne”, ovvero <b>int(*</b> <b>)[ 4 ]</b>, si possa scrivere così:
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">int</span><span style="color: #7382a0;">(</span>*<span style="color: #7382a0;">)[</span><span style="color: #465953; background-color: #d2ebe3;">4</span><span style="color: #7382a0;">]</span> myarray; <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">SYNTAX ERROR</span><span style="color: #b9a992;"> */</span>
</pre>
</div>

<p>
Ma non è così ‐ il modo corretto di dichiarare una variabile avente tipo <b>int(*</b> <b>)[ 4 ]</b> è il seguente:
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #7382a0;">(</span>*<span style="color: #4c5361; background-color: #dde4f2;">myarray</span><span style="color: #7382a0;">)[</span><span style="color: #465953; background-color: #d2ebe3;">4</span><span style="color: #7382a0;">]</span>;
</pre>
</div>

<p>
Si noti che il nome dell’identificatore myarray compare dentro le parentesi tonde appena a destra dell’asterisco. Lo stesso vale per i nomi dei parametri di funzione, che seguono le stesse regole sintat‐ tiche delle dichiarazioni di variabili.
</p>

<p>
La ragione di questa strana sintassi è che uno statement di dichiarazione può includere dichiarazioni multiple che alternano puntatori e non, quindi, a livello sintattico, i puntatori diventano qualificatori degli identificatori, come ad esempio in:
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">a</span>, *<span style="color: #4c5361; background-color: #dde4f2;">b</span>, **<span style="color: #4c5361; background-color: #dde4f2;">c</span>, <span style="color: #4c5361; background-color: #dde4f2;">d</span>; <span style="color: #b9a992;">/* </span><span style="color: #b9a992;">a e d hanno tipo int; b ha tipo int*; c ha tipo int**</span><span style="color: #b9a992;"> */</span>
</pre>
</div>

<p>
L’asterisco, in altre parole, non fa parte del sintagma del tipo nella parte sinistra, ma compare appena a sinistra dell’identificatore qualificando la promozione a puntatore. Estendendo questa regola gram‐ maticale si comprende anche la sintassi dei puntatori ad array statici e dei puntatori a funzione:
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">i</span>, <span style="color: #4c5361; background-color: #dde4f2;">j</span>, <span style="color: #7382a0;">(</span>*<span style="color: #4c5361; background-color: #dde4f2;">d</span><span style="color: #7382a0;">)[</span><span style="color: #465953; background-color: #d2ebe3;">5</span><span style="color: #7382a0;">]</span>, <span style="color: #7382a0;">(</span>*<span style="color: #605a52;">e</span><span style="color: #7382a0;">)(</span><span style="color: #605a52; background-color: #f7f3ee;">double</span>, <span style="color: #605a52; background-color: #f7f3ee;">char</span><span style="color: #7382a0;">)</span>;
</pre>
</div>

<p>
Questa riga dichiara: 2 interi i e j; un puntatore d ad array bidimensionale di interi avente 5 colonne; un puntatore e a funzione avente 2 argomenti di tipo double e char rispettivamente e tipo di ritorno int.
</p>


<p>
<a href="#sec-1">[ TOP ]​</a>  <a href="ITlist.html">[ HOME ]​</a>
</p>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Jacopo Costantini</p>
<p class="date">Created: 2022-01-25 Tue 12:54</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
